<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"3a096e3c7c8f96db155f541946f8cff40eae1626df81c9afe68fd004a8a1c495","plan_job_ref":"Job Environment Main - Plan #1780 at https://github.com/jarrod-lowe/wildsea/actions/runs/18057761688","plan_out_hash":"0ec5770050dd460a2ff437b84d5510f3665d77f872c6d15dfeff1f9e03951143","plan_hash":"92a2809fe3547c91c50a5848183675b8f362d516fc071b119dddb5c87bed1079","plan_text_format":"diff-trunc","version":"2.2.2"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
sns_alarm_topic_arn  = "arn:aws:sns:ap-southeast-2:453430506965:Pushover"
```
</details>
<details>
<summary>Plan: 21 to add, 12 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.assets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assets" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "BlockHTTP"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
    }

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.graphql_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "graphql_lambda" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "lambda:InvokeFunction",
            ]
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.wildsea.data.aws_iam_policy_document.graphql_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "graphql_s3" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.wildsea.data.aws_iam_policy_document.lambda_generate_presigned_url will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_generate_presigned_url" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:ap-southeast-2:021891603679:*",
            ]
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.wildsea.aws_appsync_datasource.lambda_generate_presigned_url will be created
+   resource "aws_appsync_datasource" "lambda_generate_presigned_url" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       description      = "Lambda data source for generating presigned URLs"
+       id               = (known after apply)
+       name             = "Wildsea_primary_lambda_generate_presigned_url"
+       region           = "ap-southeast-2"
+       service_role_arn = (known after apply)
+       type             = "AWS_LAMBDA"

+       lambda_config {
+           function_arn = (known after apply)
        }
    }

  # module.wildsea.aws_appsync_function.function["createGame"] will be updated in-place
!~  resource "aws_appsync_function" "function" {
!~      code                      = <<-EOT
            // function/createGame/createGame.ts
            import { util as util2 } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // lib/constants/entityTypes.ts
            var TypeGame = "GAME";
            var TypeGM = "GM";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixPlayer = "PLAYER";
            var DDBPrefixUser = "USER";
            var DDBPrefixJoin = "JOIN";
            
            // lib/joinCode.ts
            import { util } from "@aws-appsync/utils";
            var SAFE_CHARS = "23456789ABCDEFGHJKLMNPQRSTUVWXYZ";
            function generateJoinCode() {
              const uuid = util.autoId();
              return generateJoinCodeFromUuid(uuid);
            }
            function generateJoinCodeFromUuid(uuid) {
              const tail = uuid.split("-")[4];
              const index0 = hexByteToSafeCharIndex(tail.charAt(0), tail.charAt(1));
              const index1 = hexByteToSafeCharIndex(tail.charAt(2), tail.charAt(3));
              const index2 = hexByteToSafeCharIndex(tail.charAt(4), tail.charAt(5));
              const index3 = hexByteToSafeCharIndex(tail.charAt(6), tail.charAt(7));
              const index4 = hexByteToSafeCharIndex(tail.charAt(8), tail.charAt(9));
              const index5 = hexByteToSafeCharIndex(tail.charAt(10), tail.charAt(11));
              return SAFE_CHARS.charAt(index0) + SAFE_CHARS.charAt(index1) + SAFE_CHARS.charAt(index2) + SAFE_CHARS.charAt(index3) + SAFE_CHARS.charAt(index4) + SAFE_CHARS.charAt(index5);
            }
            function hexByteToSafeCharIndex(char1, char2) {
              const hi = hexToVal(char1);
              const lo = hexToVal(char2);
              const byteValue = hi << 4 | lo;
              return byteValue % SAFE_CHARS.length;
            }
            function hexToVal(c) {
              const lower = c.toLowerCase();
              if (lower === "0") return 0;
              if (lower === "1") return 1;
              if (lower === "2") return 2;
              if (lower === "3") return 3;
              if (lower === "4") return 4;
              if (lower === "5") return 5;
              if (lower === "6") return 6;
              if (lower === "7") return 7;
              if (lower === "8") return 8;
              if (lower === "9") return 9;
              if (lower === "a") return 10;
              if (lower === "b") return 11;
              if (lower === "c") return 12;
              if (lower === "d") return 13;
              if (lower === "e") return 14;
              return 15;
            }
            
            // lib/i18n.ts
            var defaultLanguage = "en";
            var translations = {
              en: {
                "joinGame.cannotJoinOwnGame": "You cannot join your own game",
                "joinGame.alreadyPlayer": "You are already a player in this game",
                "template.notFound": "Template not found",
                "player.cannotDelete": "Cannot delete GM sheet",
                "game.notFound": "Game not found",
                "sheet.notFound": "Sheet not found",
                "gameRecord.notFound": "Game record not found",
                "gameDefaults.missing": "Game defaults not found in stash",
                "game.unknownType": "Unknown type",
                "game.invalidType": "Invalid game type",
                "settings.sizeExceeded": "Settings exceed size limit"
              },
              tlh: {
                // Klingon translations - these are placeholders and would need proper translation
                // cspell:disable
                "joinGame.cannotJoinOwnGame": "nugh DIch DIch DIlo'meH DIch DIch",
                "joinGame.alreadyPlayer": "DIch naQ DIch DIch",
                "template.notFound": "nugh DIch tu'lu'be'",
                "player.cannotDelete": "DIch DIch lan DIch",
                "game.notFound": "nugh DIch tu'lu'be'",
                "sheet.notFound": "naQ DIch tu'lu'be'",
                "gameRecord.notFound": "nugh DIch teywI' tu'lu'be'",
                "gameDefaults.missing": "nugh DIch nugh DIch polmeH DIch tu'lu'be'",
                "game.unknownType": "Sovbe'ghach Segh",
                "game.invalidType": "nugh DIch lo'taHbe'",
                "settings.sizeExceeded": "nugh DIch nugh DIch lo'taHbe'"
                // cspell:enable
              }
            };
            function getTranslatedMessage(messageKey, language = defaultLanguage, value) {
              let message = translations[language]?.[messageKey];
              if (!message) {
                message = translations[defaultLanguage]?.[messageKey];
              }
              if (!message) {
                return value ? messageKey + ": " + value : messageKey;
              }
              if (value) {
                message = message + ": " + value;
              }
              return message;
            }
            
            // function/createGame/createGame.ts
            function request(context) {
              if (!context.identity) util2.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util2.unauthorized();
              const input = context.arguments.input;
              const id = util2.autoId();
              const joinCode = generateJoinCode();
              const timestamp = util2.time.nowISO8601();
              const gameDefaults = context.stash.gameDefaults;
              if (!gameDefaults) {
                util2.error(
                  getTranslatedMessage("gameDefaults.missing", input.language),
                  "MissingGameDefaults"
                );
              }
              const charactersToCreate = 1 + (gameDefaults?.defaultNPCs?.length || 0);
              const remainingCharacters = gameDefaults.remainingCharacters - charactersToCreate;
              context.stash.record = {
                gameName: input.name,
                gameDescription: input.description,
                gameType: input.gameType,
                gameId: id,
                GSI1PK: `${DDBPrefixJoin}#${joinCode}`,
                gmUserId: identity.sub,
                // players: no value yet
                joinCode,
                createdAt: timestamp,
                updatedAt: timestamp,
                type: TypeGame,
                theme: gameDefaults.theme,
                remainingCharacters,
          -     remainingSections: gameDefaults.remainingSections
          +     remainingSections: gameDefaults.remainingSections,
          +     remainingAssets: gameDefaults.remainingAssets
              };
              const gameItem = {
                key: util2.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + id,
                  SK: DDBPrefixGame
                }),
                operation: "PutItem",
                table: "Wildsea-" + environment_default.name,
                attributeValues: util2.dynamodb.toMapValues(
                  context.stash.record
                )
              };
              const gmItem = {
                key: util2.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + id,
                  SK: DDBPrefixPlayer + "#" + identity.sub
                }),
                operation: "PutItem",
                table: "Wildsea-" + environment_default.name,
                attributeValues: util2.dynamodb.toMapValues({
                  userId: identity.sub,
                  gameId: id,
                  gameName: input.name,
                  gameType: input.gameType,
                  gameDescription: input.description,
                  characterName: gameDefaults?.defaultGMName || "Error: No GM Name",
                  GSI1PK: DDBPrefixUser + "#" + identity.sub,
                  gmUserId: identity.sub,
                  createdAt: timestamp,
                  updatedAt: timestamp,
                  type: TypeGM,
                  remainingSections: gameDefaults.remainingSections
                })
              };
              const transactItems = [gameItem, gmItem];
              gameDefaults?.defaultNPCs.forEach((npcConfig) => {
                const npcId = util2.autoId();
                const npcItem = {
                  key: util2.dynamodb.toMapValues({
                    PK: DDBPrefixGame + "#" + id,
                    SK: DDBPrefixPlayer + "#" + npcId
                  }),
                  operation: "PutItem",
                  table: "Wildsea-" + environment_default.name,
                  attributeValues: util2.dynamodb.toMapValues({
                    userId: npcId,
                    gameId: id,
                    gameName: input.name,
                    gameDescription: input.description,
                    gameType: input.gameType,
                    characterName: npcConfig.characterName,
                    gmUserId: identity.sub,
                    createdAt: timestamp,
                    updatedAt: timestamp,
                    type: npcConfig.type,
                    remainingSections: gameDefaults.remainingSections
                  })
                };
                transactItems.push(npcItem);
              });
              return {
                operation: "TransactWriteItems",
                transactItems
              };
            }
            function response(context) {
              if (context.error) {
                util2.error(context.error.message, context.error.type, context.result);
              }
              return {
                gameName: context.stash.record.gameName,
                gameDescription: context.stash.record.gameDescription,
                gameType: context.stash.record.gameType,
                gameId: context.stash.record.gameId,
                joinCode: context.stash.record.joinCode,
                gmUserId: context.stash.record.gmUserId,
                createdAt: context.stash.record.createdAt,
                updatedAt: context.stash.record.updatedAt,
                type: context.stash.record.type,
                theme: context.stash.record.theme,
                remainingCharacters: context.stash.record.remainingCharacters,
          -     remainingSections: context.stash.record.remainingSections
          +     remainingSections: context.stash.record.remainingSections,
          +     remainingAssets: context.stash.record.remainingAssets
              };
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY3JlYXRlR2FtZS50cyIsICIuLi8uLi9lbnZpcm9ubWVudC5qc29uIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZW50aXR5VHlwZXMudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9kYlByZWZpeGVzLnRzIiwgIi4uLy4uL2xpYi9qb2luQ29kZS50cyIsICIuLi8uLi9saWIvaTE4bi50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFFBQUFBLGFBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNBVixJQUFNLFdBQVc7QUFHakIsSUFBTSxTQUFTOzs7QUNIZixJQUFNLGdCQUFnQjtBQUV0QixJQUFNLGtCQUFrQjtBQUN4QixJQUFNLGdCQUFnQjtBQUd0QixJQUFNLGdCQUFnQjs7O0FDTjdCLFNBQVMsWUFBWTtBQUVyQixJQUFNLGFBQWE7QUFFWixTQUFTLG1CQUEyQjtBQUN6QyxRQUFNLE9BQWUsS0FBSyxPQUFPO0FBQ2pDLFNBQU8seUJBQXlCLElBQUk7QUFDdEM7QUFFTyxTQUFTLHlCQUF5QixNQUFzQjtBQUM3RCxRQUFNLE9BQWUsS0FBSyxNQUFNLEdBQUcsRUFBRSxDQUFDO0FBRXRDLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLEVBQUUsR0FBRyxLQUFLLE9BQU8sRUFBRSxDQUFDO0FBRXRFLFNBQ0UsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU07QUFFNUI7QUFFQSxTQUFTLHVCQUF1QixPQUFlLE9BQXVCO0FBQ3BFLFFBQU0sS0FBSyxTQUFTLEtBQUs7QUFDekIsUUFBTSxLQUFLLFNBQVMsS0FBSztBQUN6QixRQUFNLFlBQWEsTUFBTSxJQUFLO0FBQzlCLFNBQU8sWUFBWSxXQUFXO0FBQ2hDO0FBRUEsU0FBUyxTQUFTLEdBQW1CO0FBQ25DLFFBQU0sUUFBUSxFQUFFLFlBQVk7QUFDNUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsU0FBTztBQUNUOzs7QUNuREEsSUFBTSxrQkFBa0I7QUFVeEIsSUFBTSxlQUF1QztBQUFBLEVBQzNDLElBQUk7QUFBQSxJQUNGLDhCQUE4QjtBQUFBLElBQzlCLDBCQUEwQjtBQUFBLElBQzFCLHFCQUFxQjtBQUFBLElBQ3JCLHVCQUF1QjtBQUFBLElBQ3ZCLGlCQUFpQjtBQUFBLElBQ2pCLGtCQUFrQjtBQUFBLElBQ2xCLHVCQUF1QjtBQUFBLElBQ3ZCLHdCQUF3QjtBQUFBLElBQ3hCLG9CQUFvQjtBQUFBLElBQ3BCLG9CQUFvQjtBQUFBLElBQ3BCLHlCQUF5QjtBQUFBLEVBQzNCO0FBQUEsRUFDQSxLQUFLO0FBQUE7QUFBQTtBQUFBLElBR0gsOEJBQThCO0FBQUEsSUFDOUIsMEJBQTBCO0FBQUEsSUFDMUIscUJBQXFCO0FBQUEsSUFDckIsdUJBQXVCO0FBQUEsSUFDdkIsaUJBQWlCO0FBQUEsSUFDakIsa0JBQWtCO0FBQUEsSUFDbEIsdUJBQXVCO0FBQUEsSUFDdkIsd0JBQXdCO0FBQUEsSUFDeEIsb0JBQW9CO0FBQUEsSUFDcEIsb0JBQW9CO0FBQUEsSUFDcEIseUJBQXlCO0FBQUE7QUFBQSxFQUUzQjtBQUNGO0FBU08sU0FBUyxxQkFDZCxZQUNBLFdBQW1CLGlCQUNuQixPQUNRO0FBRVIsTUFBSSxVQUFVLGFBQWEsUUFBUSxJQUFJLFVBQVU7QUFHakQsTUFBSSxDQUFDLFNBQVM7QUFDWixjQUFVLGFBQWEsZUFBZSxJQUFJLFVBQVU7QUFBQSxFQUN0RDtBQUdBLE1BQUksQ0FBQyxTQUFTO0FBQ1osV0FBTyxRQUFRLGFBQWEsT0FBTyxRQUFRO0FBQUEsRUFDN0M7QUFHQSxNQUFJLE9BQU87QUFDVCxjQUFVLFVBQVUsT0FBTztBQUFBLEVBQzdCO0FBRUEsU0FBTztBQUNUOzs7QUw1RE8sU0FBUyxRQUNkLFNBR1M7QUFDVCxNQUFJLENBQUMsUUFBUSxTQUFVLENBQUFDLE1BQUssYUFBYTtBQUN6QyxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsVUFBVSxJQUFLLENBQUFBLE1BQUssYUFBYTtBQUV0QyxRQUFNLFFBQVEsUUFBUSxVQUFVO0FBQ2hDLFFBQU0sS0FBS0EsTUFBSyxPQUFPO0FBQ3ZCLFFBQU0sV0FBVyxpQkFBaUI7QUFDbEMsUUFBTSxZQUFZQSxNQUFLLEtBQUssV0FBVztBQUV2QyxRQUFNLGVBQWUsUUFBUSxNQUFNO0FBQ25DLE1BQUksQ0FBQyxjQUFjO0FBQ2pCLElBQUFBLE1BQUs7QUFBQSxNQUNILHFCQUFxQix3QkFBd0IsTUFBTSxRQUFRO0FBQUEsTUFDM0Q7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUdBLFFBQU0scUJBQXFCLEtBQUssY0FBYyxhQUFhLFVBQVU7QUFDckUsUUFBTSxzQkFDSixhQUFhLHNCQUFzQjtBQUVyQyxVQUFRLE1BQU0sU0FBUztBQUFBLElBQ3JCLFVBQVUsTUFBTTtBQUFBLElBQ2hCLGlCQUFpQixNQUFNO0FBQUEsSUFDdkIsVUFBVSxNQUFNO0FBQUEsSUFDaEIsUUFBUTtBQUFBLElBQ1IsUUFBUSxHQUFHLGFBQWEsSUFBSSxRQUFRO0FBQUEsSUFDcEMsVUFBVSxTQUFTO0FBQUE7QUFBQSxJQUVuQjtBQUFBLElBQ0EsV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLElBQ1gsTUFBTTtBQUFBLElBQ04sT0FBTyxhQUFhO0FBQUEsSUFDcEI7QUFBQSxJQUNBLG1CQUFtQixhQUFhO0FBQUEsRUFDbEM7QUFFQSxRQUFNLFdBQVc7QUFBQSxJQUNmLEtBQUtBLE1BQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLE1BQzFCLElBQUk7QUFBQSxJQUNOLENBQUM7QUFBQSxJQUNELFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLGlCQUFpQkEsTUFBSyxTQUFTO0FBQUEsTUFDN0IsUUFBUSxNQUFNO0FBQUEsSUFDaEI7QUFBQSxFQUNGO0FBRUEsUUFBTSxTQUFTO0FBQUEsSUFDYixLQUFLQSxNQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU07QUFBQSxNQUMxQixJQUFJLGtCQUFrQixNQUFNLFNBQVM7QUFBQSxJQUN2QyxDQUFDO0FBQUEsSUFDRCxXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxpQkFBaUJBLE1BQUssU0FBUyxZQUFZO0FBQUEsTUFDekMsUUFBUSxTQUFTO0FBQUEsTUFDakIsUUFBUTtBQUFBLE1BQ1IsVUFBVSxNQUFNO0FBQUEsTUFDaEIsVUFBVSxNQUFNO0FBQUEsTUFDaEIsaUJBQWlCLE1BQU07QUFBQSxNQUN2QixlQUFlLGNBQWMsaUJBQWlCO0FBQUEsTUFDOUMsUUFBUSxnQkFBZ0IsTUFBTSxTQUFTO0FBQUEsTUFDdkMsVUFBVSxTQUFTO0FBQUEsTUFDbkIsV0FBVztBQUFBLE1BQ1gsV0FBVztBQUFBLE1BQ1gsTUFBTTtBQUFBLE1BQ04sbUJBQW1CLGFBQWE7QUFBQSxJQUNsQyxDQUFvQjtBQUFBLEVBQ3RCO0FBRUEsUUFBTSxnQkFBZ0IsQ0FBQyxVQUFVLE1BQU07QUFHdkMsZ0JBQWMsWUFBWSxRQUFRLENBQUMsY0FBYztBQUMvQyxVQUFNLFFBQVFBLE1BQUssT0FBTztBQUMxQixVQUFNLFVBQVU7QUFBQSxNQUNkLEtBQUtBLE1BQUssU0FBUyxZQUFZO0FBQUEsUUFDN0IsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLFFBQzFCLElBQUksa0JBQWtCLE1BQU07QUFBQSxNQUM5QixDQUFDO0FBQUEsTUFDRCxXQUFXO0FBQUEsTUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxNQUNoQyxpQkFBaUJBLE1BQUssU0FBUyxZQUFZO0FBQUEsUUFDekMsUUFBUTtBQUFBLFFBQ1IsUUFBUTtBQUFBLFFBQ1IsVUFBVSxNQUFNO0FBQUEsUUFDaEIsaUJBQWlCLE1BQU07QUFBQSxRQUN2QixVQUFVLE1BQU07QUFBQSxRQUNoQixlQUFlLFVBQVU7QUFBQSxRQUN6QixVQUFVLFNBQVM7QUFBQSxRQUNuQixXQUFXO0FBQUEsUUFDWCxXQUFXO0FBQUEsUUFDWCxNQUFNLFVBQVU7QUFBQSxRQUNoQixtQkFBbUIsYUFBYTtBQUFBLE1BQ2xDLENBQW9CO0FBQUEsSUFDdEI7QUFFQSxrQkFBYyxLQUFLLE9BQU87QUFBQSxFQUM1QixDQUFDO0FBRUQsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1g7QUFBQSxFQUNGO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBc0M7QUFDN0QsTUFBSSxRQUFRLE9BQU87QUFDakIsSUFBQUEsTUFBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsU0FBTztBQUFBLElBQ0wsVUFBVSxRQUFRLE1BQU0sT0FBTztBQUFBLElBQy9CLGlCQUFpQixRQUFRLE1BQU0sT0FBTztBQUFBLElBQ3RDLFVBQVUsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUMvQixRQUFRLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDN0IsVUFBVSxRQUFRLE1BQU0sT0FBTztBQUFBLElBQy9CLFVBQVUsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUMvQixXQUFXLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDaEMsV0FBVyxRQUFRLE1BQU0sT0FBTztBQUFBLElBQ2hDLE1BQU0sUUFBUSxNQUFNLE9BQU87QUFBQSxJQUMzQixPQUFPLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDNUIscUJBQXFCLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDMUMsbUJBQW1CLFFBQVEsTUFBTSxPQUFPO0FBQUEsRUFDMUM7QUFDRjsiLAogICJuYW1lcyI6IFsidXRpbCIsICJ1dGlsIl0KfQo=
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY3JlYXRlR2FtZS50cyIsICIuLi8uLi9lbnZpcm9ubWVudC5qc29uIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZW50aXR5VHlwZXMudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9kYlByZWZpeGVzLnRzIiwgIi4uLy4uL2xpYi9qb2luQ29kZS50cyIsICIuLi8uLi9saWIvaTE4bi50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFFBQUFBLGFBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNBVixJQUFNLFdBQVc7QUFHakIsSUFBTSxTQUFTOzs7QUNIZixJQUFNLGdCQUFnQjtBQUV0QixJQUFNLGtCQUFrQjtBQUN4QixJQUFNLGdCQUFnQjtBQUd0QixJQUFNLGdCQUFnQjs7O0FDTjdCLFNBQVMsWUFBWTtBQUVyQixJQUFNLGFBQWE7QUFFWixTQUFTLG1CQUEyQjtBQUN6QyxRQUFNLE9BQWUsS0FBSyxPQUFPO0FBQ2pDLFNBQU8seUJBQXlCLElBQUk7QUFDdEM7QUFFTyxTQUFTLHlCQUF5QixNQUFzQjtBQUM3RCxRQUFNLE9BQWUsS0FBSyxNQUFNLEdBQUcsRUFBRSxDQUFDO0FBRXRDLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLENBQUMsR0FBRyxLQUFLLE9BQU8sQ0FBQyxDQUFDO0FBQ3BFLFFBQU0sU0FBUyx1QkFBdUIsS0FBSyxPQUFPLEVBQUUsR0FBRyxLQUFLLE9BQU8sRUFBRSxDQUFDO0FBRXRFLFNBQ0UsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU0sSUFDeEIsV0FBVyxPQUFPLE1BQU07QUFFNUI7QUFFQSxTQUFTLHVCQUF1QixPQUFlLE9BQXVCO0FBQ3BFLFFBQU0sS0FBSyxTQUFTLEtBQUs7QUFDekIsUUFBTSxLQUFLLFNBQVMsS0FBSztBQUN6QixRQUFNLFlBQWEsTUFBTSxJQUFLO0FBQzlCLFNBQU8sWUFBWSxXQUFXO0FBQ2hDO0FBRUEsU0FBUyxTQUFTLEdBQW1CO0FBQ25DLFFBQU0sUUFBUSxFQUFFLFlBQVk7QUFDNUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsTUFBSSxVQUFVLElBQUssUUFBTztBQUMxQixNQUFJLFVBQVUsSUFBSyxRQUFPO0FBQzFCLE1BQUksVUFBVSxJQUFLLFFBQU87QUFDMUIsU0FBTztBQUNUOzs7QUNuREEsSUFBTSxrQkFBa0I7QUFVeEIsSUFBTSxlQUF1QztBQUFBLEVBQzNDLElBQUk7QUFBQSxJQUNGLDhCQUE4QjtBQUFBLElBQzlCLDBCQUEwQjtBQUFBLElBQzFCLHFCQUFxQjtBQUFBLElBQ3JCLHVCQUF1QjtBQUFBLElBQ3ZCLGlCQUFpQjtBQUFBLElBQ2pCLGtCQUFrQjtBQUFBLElBQ2xCLHVCQUF1QjtBQUFBLElBQ3ZCLHdCQUF3QjtBQUFBLElBQ3hCLG9CQUFvQjtBQUFBLElBQ3BCLG9CQUFvQjtBQUFBLElBQ3BCLHlCQUF5QjtBQUFBLEVBQzNCO0FBQUEsRUFDQSxLQUFLO0FBQUE7QUFBQTtBQUFBLElBR0gsOEJBQThCO0FBQUEsSUFDOUIsMEJBQTBCO0FBQUEsSUFDMUIscUJBQXFCO0FBQUEsSUFDckIsdUJBQXVCO0FBQUEsSUFDdkIsaUJBQWlCO0FBQUEsSUFDakIsa0JBQWtCO0FBQUEsSUFDbEIsdUJBQXVCO0FBQUEsSUFDdkIsd0JBQXdCO0FBQUEsSUFDeEIsb0JBQW9CO0FBQUEsSUFDcEIsb0JBQW9CO0FBQUEsSUFDcEIseUJBQXlCO0FBQUE7QUFBQSxFQUUzQjtBQUNGO0FBU08sU0FBUyxxQkFDZCxZQUNBLFdBQW1CLGlCQUNuQixPQUNRO0FBRVIsTUFBSSxVQUFVLGFBQWEsUUFBUSxJQUFJLFVBQVU7QUFHakQsTUFBSSxDQUFDLFNBQVM7QUFDWixjQUFVLGFBQWEsZUFBZSxJQUFJLFVBQVU7QUFBQSxFQUN0RDtBQUdBLE1BQUksQ0FBQyxTQUFTO0FBQ1osV0FBTyxRQUFRLGFBQWEsT0FBTyxRQUFRO0FBQUEsRUFDN0M7QUFHQSxNQUFJLE9BQU87QUFDVCxjQUFVLFVBQVUsT0FBTztBQUFBLEVBQzdCO0FBRUEsU0FBTztBQUNUOzs7QUw1RE8sU0FBUyxRQUNkLFNBR1M7QUFDVCxNQUFJLENBQUMsUUFBUSxTQUFVLENBQUFDLE1BQUssYUFBYTtBQUN6QyxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsVUFBVSxJQUFLLENBQUFBLE1BQUssYUFBYTtBQUV0QyxRQUFNLFFBQVEsUUFBUSxVQUFVO0FBQ2hDLFFBQU0sS0FBS0EsTUFBSyxPQUFPO0FBQ3ZCLFFBQU0sV0FBVyxpQkFBaUI7QUFDbEMsUUFBTSxZQUFZQSxNQUFLLEtBQUssV0FBVztBQUV2QyxRQUFNLGVBQWUsUUFBUSxNQUFNO0FBQ25DLE1BQUksQ0FBQyxjQUFjO0FBQ2pCLElBQUFBLE1BQUs7QUFBQSxNQUNILHFCQUFxQix3QkFBd0IsTUFBTSxRQUFRO0FBQUEsTUFDM0Q7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUdBLFFBQU0scUJBQXFCLEtBQUssY0FBYyxhQUFhLFVBQVU7QUFDckUsUUFBTSxzQkFDSixhQUFhLHNCQUFzQjtBQUVyQyxVQUFRLE1BQU0sU0FBUztBQUFBLElBQ3JCLFVBQVUsTUFBTTtBQUFBLElBQ2hCLGlCQUFpQixNQUFNO0FBQUEsSUFDdkIsVUFBVSxNQUFNO0FBQUEsSUFDaEIsUUFBUTtBQUFBLElBQ1IsUUFBUSxHQUFHLGFBQWEsSUFBSSxRQUFRO0FBQUEsSUFDcEMsVUFBVSxTQUFTO0FBQUE7QUFBQSxJQUVuQjtBQUFBLElBQ0EsV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLElBQ1gsTUFBTTtBQUFBLElBQ04sT0FBTyxhQUFhO0FBQUEsSUFDcEI7QUFBQSxJQUNBLG1CQUFtQixhQUFhO0FBQUEsSUFDaEMsaUJBQWlCLGFBQWE7QUFBQSxFQUNoQztBQUVBLFFBQU0sV0FBVztBQUFBLElBQ2YsS0FBS0EsTUFBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNO0FBQUEsTUFDMUIsSUFBSTtBQUFBLElBQ04sQ0FBQztBQUFBLElBQ0QsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsaUJBQWlCQSxNQUFLLFNBQVM7QUFBQSxNQUM3QixRQUFRLE1BQU07QUFBQSxJQUNoQjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLFNBQVM7QUFBQSxJQUNiLEtBQUtBLE1BQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLE1BQzFCLElBQUksa0JBQWtCLE1BQU0sU0FBUztBQUFBLElBQ3ZDLENBQUM7QUFBQSxJQUNELFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLGlCQUFpQkEsTUFBSyxTQUFTLFlBQVk7QUFBQSxNQUN6QyxRQUFRLFNBQVM7QUFBQSxNQUNqQixRQUFRO0FBQUEsTUFDUixVQUFVLE1BQU07QUFBQSxNQUNoQixVQUFVLE1BQU07QUFBQSxNQUNoQixpQkFBaUIsTUFBTTtBQUFBLE1BQ3ZCLGVBQWUsY0FBYyxpQkFBaUI7QUFBQSxNQUM5QyxRQUFRLGdCQUFnQixNQUFNLFNBQVM7QUFBQSxNQUN2QyxVQUFVLFNBQVM7QUFBQSxNQUNuQixXQUFXO0FBQUEsTUFDWCxXQUFXO0FBQUEsTUFDWCxNQUFNO0FBQUEsTUFDTixtQkFBbUIsYUFBYTtBQUFBLElBQ2xDLENBQW9CO0FBQUEsRUFDdEI7QUFFQSxRQUFNLGdCQUFnQixDQUFDLFVBQVUsTUFBTTtBQUd2QyxnQkFBYyxZQUFZLFFBQVEsQ0FBQyxjQUFjO0FBQy9DLFVBQU0sUUFBUUEsTUFBSyxPQUFPO0FBQzFCLFVBQU0sVUFBVTtBQUFBLE1BQ2QsS0FBS0EsTUFBSyxTQUFTLFlBQVk7QUFBQSxRQUM3QixJQUFJLGdCQUFnQixNQUFNO0FBQUEsUUFDMUIsSUFBSSxrQkFBa0IsTUFBTTtBQUFBLE1BQzlCLENBQUM7QUFBQSxNQUNELFdBQVc7QUFBQSxNQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLE1BQ2hDLGlCQUFpQkEsTUFBSyxTQUFTLFlBQVk7QUFBQSxRQUN6QyxRQUFRO0FBQUEsUUFDUixRQUFRO0FBQUEsUUFDUixVQUFVLE1BQU07QUFBQSxRQUNoQixpQkFBaUIsTUFBTTtBQUFBLFFBQ3ZCLFVBQVUsTUFBTTtBQUFBLFFBQ2hCLGVBQWUsVUFBVTtBQUFBLFFBQ3pCLFVBQVUsU0FBUztBQUFBLFFBQ25CLFdBQVc7QUFBQSxRQUNYLFdBQVc7QUFBQSxRQUNYLE1BQU0sVUFBVTtBQUFBLFFBQ2hCLG1CQUFtQixhQUFhO0FBQUEsTUFDbEMsQ0FBb0I7QUFBQSxJQUN0QjtBQUVBLGtCQUFjLEtBQUssT0FBTztBQUFBLEVBQzVCLENBQUM7QUFFRCxTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWDtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUFzQztBQUM3RCxNQUFJLFFBQVEsT0FBTztBQUNqQixJQUFBQSxNQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxTQUFPO0FBQUEsSUFDTCxVQUFVLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDL0IsaUJBQWlCLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDdEMsVUFBVSxRQUFRLE1BQU0sT0FBTztBQUFBLElBQy9CLFFBQVEsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUM3QixVQUFVLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDL0IsVUFBVSxRQUFRLE1BQU0sT0FBTztBQUFBLElBQy9CLFdBQVcsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUNoQyxXQUFXLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDaEMsTUFBTSxRQUFRLE1BQU0sT0FBTztBQUFBLElBQzNCLE9BQU8sUUFBUSxNQUFNLE9BQU87QUFBQSxJQUM1QixxQkFBcUIsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUMxQyxtQkFBbUIsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUN4QyxpQkFBaUIsUUFBUSxNQUFNLE9BQU87QUFBQSxFQUN4QztBQUNGOyIsCiAgIm5hbWVzIjogWyJ1dGlsIiwgInV0aWwiXQp9Cg==
        EOT
        id                        = "tfiz6mnf2nhyzpzkwm554sir5q-dvs6b5pk6nhtro447pl43dn2oa"
        name                      = "createGame"
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_function.function["generatePresignedUrl"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/generatePresignedUrl/generatePresignedUrl.ts
            import { util } from "@aws-appsync/utils";
            function request(context) {
              const payload = {
                assetData: context.prev.result.assetData,
                input: context.prev.result.input
              };
              return {
                operation: "Invoke",
                payload
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              const result = context.result;
              const assetData = result.assetData;
              return {
                asset: {
                  gameId: assetData.gameId,
                  sectionId: assetData.sectionId,
                  assetId: assetData.assetId,
                  label: assetData.label,
                  status: assetData.status,
                  mimeType: assetData.mimeType,
                  sizeBytes: assetData.sizeBytes,
                  createdAt: assetData.createdAt,
                  updatedAt: assetData.updatedAt,
                  type: assetData.type
                },
                uploadUrl: result.uploadUrl,
                uploadFields: JSON.stringify(result.uploadFields)
              };
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZ2VuZXJhdGVQcmVzaWduZWRVcmwudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUFxQjtBQUd2QixTQUFTLFFBQVEsU0FBMkI7QUFFakQsUUFBTSxVQUFVO0FBQUEsSUFDZCxXQUFXLFFBQVEsS0FBSyxPQUFPO0FBQUEsSUFDL0IsT0FBTyxRQUFRLEtBQUssT0FBTztBQUFBLEVBQzdCO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1g7QUFBQSxFQUNGO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBNEM7QUFDbkUsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsUUFBTSxTQUFTLFFBQVE7QUFDdkIsUUFBTSxZQUFZLE9BQU87QUFFekIsU0FBTztBQUFBLElBQ0wsT0FBTztBQUFBLE1BQ0wsUUFBUSxVQUFVO0FBQUEsTUFDbEIsV0FBVyxVQUFVO0FBQUEsTUFDckIsU0FBUyxVQUFVO0FBQUEsTUFDbkIsT0FBTyxVQUFVO0FBQUEsTUFDakIsUUFBUSxVQUFVO0FBQUEsTUFDbEIsVUFBVSxVQUFVO0FBQUEsTUFDcEIsV0FBVyxVQUFVO0FBQUEsTUFDckIsV0FBVyxVQUFVO0FBQUEsTUFDckIsV0FBVyxVQUFVO0FBQUEsTUFDckIsTUFBTSxVQUFVO0FBQUEsSUFDbEI7QUFBQSxJQUNBLFdBQVcsT0FBTztBQUFBLElBQ2xCLGNBQWMsS0FBSyxVQUFVLE9BQU8sWUFBWTtBQUFBLEVBQ2xEO0FBQ0Y7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
+       data_source      = "Wildsea_primary_lambda_generate_presigned_url"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "generatePresignedUrl"
+       region           = "ap-southeast-2"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["getGame"] will be updated in-place
!~  resource "aws_appsync_function" "function" {
!~      code                      = <<-EOT
            // function/getGame/getGame.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/entityTypes.ts
            var TypeGame = "GAME";
            var TypeCharacter = "CHARACTER";
            var TypeSection = "SECTION";
            var TypeGM = "GM";
            var TypeNPC = "NPC";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            
            // lib/i18n.ts
            var defaultLanguage = "en";
            var translations = {
              en: {
                "joinGame.cannotJoinOwnGame": "You cannot join your own game",
                "joinGame.alreadyPlayer": "You are already a player in this game",
                "template.notFound": "Template not found",
                "player.cannotDelete": "Cannot delete GM sheet",
                "game.notFound": "Game not found",
                "sheet.notFound": "Sheet not found",
                "gameRecord.notFound": "Game record not found",
                "gameDefaults.missing": "Game defaults not found in stash",
                "game.unknownType": "Unknown type",
                "game.invalidType": "Invalid game type",
                "settings.sizeExceeded": "Settings exceed size limit"
              },
              tlh: {
                // Klingon translations - these are placeholders and would need proper translation
                // cspell:disable
                "joinGame.cannotJoinOwnGame": "nugh DIch DIch DIlo'meH DIch DIch",
                "joinGame.alreadyPlayer": "DIch naQ DIch DIch",
                "template.notFound": "nugh DIch tu'lu'be'",
                "player.cannotDelete": "DIch DIch lan DIch",
                "game.notFound": "nugh DIch tu'lu'be'",
                "sheet.notFound": "naQ DIch tu'lu'be'",
                "gameRecord.notFound": "nugh DIch teywI' tu'lu'be'",
                "gameDefaults.missing": "nugh DIch nugh DIch polmeH DIch tu'lu'be'",
                "game.unknownType": "Sovbe'ghach Segh",
                "game.invalidType": "nugh DIch lo'taHbe'",
                "settings.sizeExceeded": "nugh DIch nugh DIch lo'taHbe'"
                // cspell:enable
              }
            };
            function getTranslatedMessage(messageKey, language = defaultLanguage, value) {
              let message = translations[language]?.[messageKey];
              if (!message) {
                message = translations[defaultLanguage]?.[messageKey];
              }
              if (!message) {
                return value ? messageKey + ": " + value : messageKey;
              }
              if (value) {
                message = message + ": " + value;
              }
              return message;
            }
            
            // function/getGame/getGame.ts
            function request(context) {
              validateIdentity(context);
              return buildDynamoDBQuery(context.arguments.input.gameId);
            }
            function validateIdentity(context) {
              if (!context.identity) util.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util.unauthorized();
            }
            function buildDynamoDBQuery(id) {
              const pk = DDBPrefixGame + "#" + id;
              const expr = {
                expression: "#pk = :pk",
                expressionNames: {
                  "#pk": "PK"
                },
                expressionValues: {
                  ":pk": { S: pk }
                }
              };
              return {
                operation: "Query",
                query: expr
              };
            }
            function response(context) {
              validateResponse(context);
              validateIdentity(context);
              const identity = context.identity;
              const language = context.arguments.input.language;
              const sheets = buildPlayerSheets(context.result.items, language);
              const game = findAndBuildGame(context.result.items, identity.sub, language);
              addSheetsToGame(game, sheets);
              return game;
            }
            function validateResponse(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              if (!context.result?.items?.length) {
                const language = context.arguments.input.language;
                util.error(getTranslatedMessage("game.notFound", language));
              }
            }
            function buildPlayerSheets(items, language) {
              const sheets = {};
              items.forEach((data) => {
                if (data.type === TypeCharacter || data.type === TypeGM || data.type === TypeNPC) {
                  const sheet = makeCharacterSheetData(data);
                  sheets[sheet.userId] = sheet;
                } else if (data.type === TypeSection) {
                  addSectionToSheet(sheets, data, language);
                } else if (data.type != TypeGame) {
                  util.error(getTranslatedMessage("game.unknownType", language, data.type));
                }
              });
              return sheets;
            }
            function addSectionToSheet(sheets, data, language) {
              const section = makeSheetSection(data);
              const sheet = sheets[section.userId];
              if (sheet === void 0) {
                util.error(getTranslatedMessage("sheet.notFound", language));
              }
              sheet.sections.push(section);
            }
            function findAndBuildGame(items, sub, language) {
              const gameData = items.find((data) => data.type === TypeGame);
              if (!gameData) {
                util.error(getTranslatedMessage("gameRecord.notFound", language));
              }
              return makeGameData(gameData, sub);
            }
            function addSheetsToGame(game, sheets) {
              const userIds = Object.keys(sheets).sort();
              userIds.forEach((userId) => {
                game.playerSheets.push(sheets[userId]);
              });
            }
            function makeGameData(data, sub) {
              let joinCode = null;
              if (data.gmUserId == sub) {
                joinCode = data.joinCode;
              }
              return {
                gameId: data.gameId,
                gameName: data.gameName,
                gameType: data.gameType,
                gameDescription: data.gameDescription,
                playerSheets: [],
                joinCode,
                gmUserId: data.gmUserId,
                createdAt: data.createdAt,
                updatedAt: data.updatedAt,
                type: data.type,
                theme: data.theme,
                remainingCharacters: data.remainingCharacters,
          -     remainingSections: data.remainingSections
          +     remainingSections: data.remainingSections,
          +     remainingAssets: data.remainingAssets
              };
            }
            function makeCharacterSheetData(data) {
              return {
                userId: data.userId,
                gameId: data.gameId,
                characterName: data.characterName,
                createdAt: data.createdAt,
                updatedAt: data.updatedAt,
                type: data.type,
                sections: [],
                gmUserId: data.gmUserId,
                remainingSections: data.remainingSections
              };
            }
            function makeSheetSection(data) {
              return {
                userId: data.userId,
                gameId: data.gameId,
                sectionId: data.sectionId,
                sectionName: data.sectionName,
                sectionType: data.sectionType,
                content: data.content,
                position: data.position,
                createdAt: data.createdAt,
                updatedAt: data.updatedAt,
                type: data.type
              };
            }
            export {
              makeCharacterSheetData,
              makeGameData,
              makeSheetSection,
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZ2V0R2FtZS50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2VudGl0eVR5cGVzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyIsICIuLi8uLi9saWIvaTE4bi50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNBL0MsSUFBTSxXQUFXO0FBQ2pCLElBQU0sZ0JBQWdCO0FBQ3RCLElBQU0sY0FBYztBQUNwQixJQUFNLFNBQVM7QUFDZixJQUFNLFVBQVU7OztBQ0poQixJQUFNLGdCQUFnQjs7O0FDRzdCLElBQU0sa0JBQWtCO0FBVXhCLElBQU0sZUFBdUM7QUFBQSxFQUMzQyxJQUFJO0FBQUEsSUFDRiw4QkFBOEI7QUFBQSxJQUM5QiwwQkFBMEI7QUFBQSxJQUMxQixxQkFBcUI7QUFBQSxJQUNyQix1QkFBdUI7QUFBQSxJQUN2QixpQkFBaUI7QUFBQSxJQUNqQixrQkFBa0I7QUFBQSxJQUNsQix1QkFBdUI7QUFBQSxJQUN2Qix3QkFBd0I7QUFBQSxJQUN4QixvQkFBb0I7QUFBQSxJQUNwQixvQkFBb0I7QUFBQSxJQUNwQix5QkFBeUI7QUFBQSxFQUMzQjtBQUFBLEVBQ0EsS0FBSztBQUFBO0FBQUE7QUFBQSxJQUdILDhCQUE4QjtBQUFBLElBQzlCLDBCQUEwQjtBQUFBLElBQzFCLHFCQUFxQjtBQUFBLElBQ3JCLHVCQUF1QjtBQUFBLElBQ3ZCLGlCQUFpQjtBQUFBLElBQ2pCLGtCQUFrQjtBQUFBLElBQ2xCLHVCQUF1QjtBQUFBLElBQ3ZCLHdCQUF3QjtBQUFBLElBQ3hCLG9CQUFvQjtBQUFBLElBQ3BCLG9CQUFvQjtBQUFBLElBQ3BCLHlCQUF5QjtBQUFBO0FBQUEsRUFFM0I7QUFDRjtBQVNPLFNBQVMscUJBQ2QsWUFDQSxXQUFtQixpQkFDbkIsT0FDUTtBQUVSLE1BQUksVUFBVSxhQUFhLFFBQVEsSUFBSSxVQUFVO0FBR2pELE1BQUksQ0FBQyxTQUFTO0FBQ1osY0FBVSxhQUFhLGVBQWUsSUFBSSxVQUFVO0FBQUEsRUFDdEQ7QUFHQSxNQUFJLENBQUMsU0FBUztBQUNaLFdBQU8sUUFBUSxhQUFhLE9BQU8sUUFBUTtBQUFBLEVBQzdDO0FBR0EsTUFBSSxPQUFPO0FBQ1QsY0FBVSxVQUFVLE9BQU87QUFBQSxFQUM3QjtBQUVBLFNBQU87QUFDVDs7O0FIaERPLFNBQVMsUUFDZCxTQUNzQjtBQUN0QixtQkFBaUIsT0FBTztBQUN4QixTQUFPLG1CQUFtQixRQUFRLFVBQVUsTUFBTSxNQUFNO0FBQzFEO0FBRUEsU0FBUyxpQkFBaUIsU0FBMEM7QUFDbEUsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFDeEM7QUFFQSxTQUFTLG1CQUFtQixJQUFrQztBQUM1RCxRQUFNLEtBQUssZ0JBQWdCLE1BQU07QUFDakMsUUFBTSxPQUEyQjtBQUFBLElBQy9CLFlBQVk7QUFBQSxJQUNaLGlCQUFpQjtBQUFBLE1BQ2YsT0FBTztBQUFBLElBQ1Q7QUFBQSxJQUNBLGtCQUFrQjtBQUFBLE1BQ2hCLE9BQU8sRUFBRSxHQUFHLEdBQUc7QUFBQSxJQUNqQjtBQUFBLEVBQ0Y7QUFDQSxTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWCxPQUFPO0FBQUEsRUFDVDtBQUNGO0FBVU8sU0FBUyxTQUFTLFNBQTRDO0FBQ25FLG1CQUFpQixPQUFPO0FBQ3hCLG1CQUFpQixPQUFPO0FBRXhCLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLFFBQU0sV0FBVyxRQUFRLFVBQVUsTUFBTTtBQUN6QyxRQUFNLFNBQVMsa0JBQWtCLFFBQVEsT0FBTyxPQUFPLFFBQVE7QUFDL0QsUUFBTSxPQUFPLGlCQUFpQixRQUFRLE9BQU8sT0FBTyxTQUFTLEtBQUssUUFBUTtBQUUxRSxrQkFBZ0IsTUFBTSxNQUFNO0FBQzVCLFNBQU87QUFDVDtBQUVBLFNBQVMsaUJBQWlCLFNBQWdDO0FBQ3hELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUVBLE1BQUksQ0FBQyxRQUFRLFFBQVEsT0FBTyxRQUFRO0FBQ2xDLFVBQU0sV0FBVyxRQUFRLFVBQVUsTUFBTTtBQUN6QyxTQUFLLE1BQU0scUJBQXFCLGlCQUFpQixRQUFRLENBQUM7QUFBQSxFQUM1RDtBQUNGO0FBRUEsU0FBUyxrQkFDUCxPQUNBLFVBQzZCO0FBQzdCLFFBQU0sU0FBc0MsQ0FBQztBQUM3QyxRQUFNLFFBQVEsQ0FBQyxTQUFTO0FBQ3RCLFFBQ0UsS0FBSyxTQUFTLGlCQUNkLEtBQUssU0FBUyxVQUNkLEtBQUssU0FBUyxTQUNkO0FBQ0EsWUFBTSxRQUFRLHVCQUF1QixJQUF1QjtBQUM1RCxhQUFPLE1BQU0sTUFBTSxJQUFJO0FBQUEsSUFDekIsV0FBVyxLQUFLLFNBQVMsYUFBYTtBQUNwQyx3QkFBa0IsUUFBUSxNQUEwQixRQUFRO0FBQUEsSUFDOUQsV0FBVyxLQUFLLFFBQVEsVUFBVTtBQUNoQyxXQUFLLE1BQU0scUJBQXFCLG9CQUFvQixVQUFVLEtBQUssSUFBSSxDQUFDO0FBQUEsSUFDMUU7QUFBQSxFQUNGLENBQUM7QUFDRCxTQUFPO0FBQ1Q7QUFFQSxTQUFTLGtCQUNQLFFBQ0EsTUFDQSxVQUNNO0FBQ04sUUFBTSxVQUFVLGlCQUFpQixJQUFJO0FBQ3JDLFFBQU0sUUFBUSxPQUFPLFFBQVEsTUFBTTtBQUNuQyxNQUFJLFVBQVUsUUFBVztBQUN2QixTQUFLLE1BQU0scUJBQXFCLGtCQUFrQixRQUFRLENBQUM7QUFBQSxFQUM3RDtBQUNBLFFBQU0sU0FBUyxLQUFLLE9BQU87QUFDN0I7QUFFQSxTQUFTLGlCQUFpQixPQUFlLEtBQWEsVUFBd0I7QUFDNUUsUUFBTSxXQUFXLE1BQU0sS0FBSyxDQUFDLFNBQVMsS0FBSyxTQUFTLFFBQVE7QUFDNUQsTUFBSSxDQUFDLFVBQVU7QUFDYixTQUFLLE1BQU0scUJBQXFCLHVCQUF1QixRQUFRLENBQUM7QUFBQSxFQUNsRTtBQUNBLFNBQU8sYUFBYSxVQUFVLEdBQUc7QUFDbkM7QUFFQSxTQUFTLGdCQUNQLE1BQ0EsUUFDTTtBQUNOLFFBQU0sVUFBVSxPQUFPLEtBQUssTUFBTSxFQUFFLEtBQUs7QUFDekMsVUFBUSxRQUFRLENBQUMsV0FBVztBQUMxQixTQUFLLGFBQWEsS0FBSyxPQUFPLE1BQU0sQ0FBQztBQUFBLEVBQ3ZDLENBQUM7QUFDSDtBQUVPLFNBQVMsYUFBYSxNQUFnQixLQUFtQjtBQUM5RCxNQUFJLFdBQVc7QUFDZixNQUFJLEtBQUssWUFBWSxLQUFLO0FBQ3hCLGVBQVcsS0FBSztBQUFBLEVBQ2xCO0FBQ0EsU0FBTztBQUFBLElBQ0wsUUFBUSxLQUFLO0FBQUEsSUFDYixVQUFVLEtBQUs7QUFBQSxJQUNmLFVBQVUsS0FBSztBQUFBLElBQ2YsaUJBQWlCLEtBQUs7QUFBQSxJQUN0QixjQUFjLENBQUM7QUFBQSxJQUNmO0FBQUEsSUFDQSxVQUFVLEtBQUs7QUFBQSxJQUNmLFdBQVcsS0FBSztBQUFBLElBQ2hCLFdBQVcsS0FBSztBQUFBLElBQ2hCLE1BQU0sS0FBSztBQUFBLElBQ1gsT0FBTyxLQUFLO0FBQUEsSUFDWixxQkFBcUIsS0FBSztBQUFBLElBQzFCLG1CQUFtQixLQUFLO0FBQUEsRUFDMUI7QUFDRjtBQUVPLFNBQVMsdUJBQXVCLE1BQW9DO0FBQ3pFLFNBQU87QUFBQSxJQUNMLFFBQVEsS0FBSztBQUFBLElBQ2IsUUFBUSxLQUFLO0FBQUEsSUFDYixlQUFlLEtBQUs7QUFBQSxJQUNwQixXQUFXLEtBQUs7QUFBQSxJQUNoQixXQUFXLEtBQUs7QUFBQSxJQUNoQixNQUFNLEtBQUs7QUFBQSxJQUNYLFVBQVUsQ0FBQztBQUFBLElBQ1gsVUFBVSxLQUFLO0FBQUEsSUFDZixtQkFBbUIsS0FBSztBQUFBLEVBQzFCO0FBQ0Y7QUFFTyxTQUFTLGlCQUFpQixNQUFzQztBQUNyRSxTQUFPO0FBQUEsSUFDTCxRQUFRLEtBQUs7QUFBQSxJQUNiLFFBQVEsS0FBSztBQUFBLElBQ2IsV0FBVyxLQUFLO0FBQUEsSUFDaEIsYUFBYSxLQUFLO0FBQUEsSUFDbEIsYUFBYSxLQUFLO0FBQUEsSUFDbEIsU0FBUyxLQUFLO0FBQUEsSUFDZCxVQUFVLEtBQUs7QUFBQSxJQUNmLFdBQVcsS0FBSztBQUFBLElBQ2hCLFdBQVcsS0FBSztBQUFBLElBQ2hCLE1BQU0sS0FBSztBQUFBLEVBQ2I7QUFDRjsiLAogICJuYW1lcyI6IFtdCn0K
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Environment Main - Plan #1780](https://github.com/jarrod-lowe/wildsea/actions/runs/18057761688)